SURA_NAME_AR = <<-END
سُوۡرَةُ الفَاتِحَة
سُوۡرَةُ البَقَرَة
سُوۡرَةُ آل عِمرَان
سُوۡرَةُ النِّسَاء
سُوۡرَةُ المَائدة
سُوۡرَةُ الاٴنعَام
سُوۡرَةُ الاٴعرَاف
سُوۡرَةُ الاٴنفَال
سُوۡرَةُ التّوبَة
سُوۡرَةُ یُونس
سُوۡرَةُ هُود
سُوۡرَةُ یُوسُف
سُوۡرَةُ یُوسُف
سُوۡرَةُ إبراهیم
سُوۡرَةُ الحِجر
سُوۡرَةُ النّحل
سُوۡرَةُ بنیٓ اسرآئیل / الإسرَاء
سُوۡرَةُ الکهف
سُوۡرَةُ مَریَم
سُوۡرَةُ طٰه
سُوۡرَةُ الاٴنبیَاء
سُوۡرَةُ الاٴنبیَاء
سُوۡرَةُ المؤمنون
سُوۡرَةُ النُّور
سُوۡرَةُ الفُرقان
سُوۡرَةُ الشُّعَرَاء
سُوۡرَةُ النَّمل
سُوۡرَةُ القَصَص
سُوۡرَةُ العَنکبوت
سُوۡرَةُ الرُّوم
سُوۡرَةُ لقمَان
سُوۡرَةُ السَّجدَة
سُوۡرَةُ الاٴحزَاب
سُوۡرَةُ سَبَإ
سُوۡرَةُ فَاطِر
سُوۡرَةُ یسٓ
سُوۡرَةُ الصَّافات
سُوۡرَةُ صٓ
سُوۡرَةُ الزُّمَر
سُوۡرَةُ المؤمن / غَافر
سُوۡرَةُ حٰمٓ السجدة / فُصّلَت
سُوۡرَةُ الشّوریٰ
سُوۡرَةُ الزّخرُف
سُوۡرَةُ الدّخان
سُوۡرَةُ الجَاثیَة
سُوۡرَةُ الاٴحقاف
سُوۡرَةُ محَمَّد
سُوۡرَةُ الفَتْح
سُوۡرَةُ الحُجرَات
سُوۡرَةُ قٓ
سُوۡرَةُ الذّاریَات
سُوۡرَةُ الطُّور
سُوۡرَةُ النّجْم
سُوۡرَةُ القَمَر
سُوۡرَةُ الرَّحمٰن
سُوۡرَةُ الواقِعَة
سُوۡرَةُ الحَدید
سُوۡرَةُ المجَادلة
سُوۡرَةُ الحَشر
سُوۡرَةُ المُمتَحنَة
سُوۡرَةُ الصَّف
سُوۡرَةُ الجُمُعَة
سُوۡرَةُ المنَافِقون
سُوۡرَةُ التّغَابُن
سُوۡرَةُ الطّلاَق
سُوۡرَةُ التّحْریم
سُوۡرَةُ المُلک
سُوۡرَةُ القَلَم
سُوۡرَةُ الحَاقَّة
سُوۡرَةُ المعَارج
سُوۡرَةُ نُوح
سُوۡرَةُ الجنّ
سُوۡرَةُ المُزمّل
سُوۡرَةُ المدَّثِّر
سُوۡرَةُ القِیَامَة
سُوۡرَةُ ٱلدَّهۡر / الإنسَان
سُوۡرَةُ المُرسَلات
سُوۡرَةُ النّبَإِ
سُوۡرَةُ النَّازعَات
سُوۡرَةُ عَبَسَ
سُوۡرَةُ التّکویر
سُوۡرَةُ الانفِطار
سُوۡرَةُ المطفّفِین
سُوۡرَةُ الانشقاق
سُوۡرَةُ البُرُوج
سُوۡرَةُ الطّارق
سُوۡرَةُ الاٴعلی
سُوۡرَةُ الغَاشِیَة
سُوۡرَةُ الفَجر
سُوۡرَةُ البَلَد
سُوۡرَةُ الشّمس
سُوۡرَةُ اللیْل
سُوۡرَةُ الِضُّحىٰ
سُوۡرَةُ الشَّرح
سُوۡرَةُ التِّین
سُوۡرَةُ العَلق
سُوۡرَةُ القَدر
سُوۡرَةُ البَیّنَة
سُوۡرَةُ الزّلزَلة
سُوۡرَةُ العَادیَات
سُوۡرَةُ القَارعَة
سُوۡرَةُ التّکاثُر
سُوۡرَةُ العَصر
سُوۡرَةُ الهُمَزة
سُوۡرَةُ الفِیل
سُوۡرَةُ قُرَیش
سُوۡرَةُ المَاعون
سُوۡرَةُ الکَوثَر
سُوۡرَةُ الکافِرون
سُوۡرَةُ النّصر
سُوۡرَةُ لهب / المَسَد
سُوۡرَةُ الإخلاص
سُوۡرَةُ الفَلَق
سُوۡرَةُ النَّاس
END
.split("\n")


def no_to_sura_name(sura_no)
    SURA_NAME_AR[sura_no]
end
